vecnode/esp32js/hw/timer/esp_timg.c
/*
 * Timer Group emulation for recent ESP32-series chip (ESP32-S3 and newer)
 *
 * Copyright (c) 2023-2025 Espressif Systems (Shanghai) Co. Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/error-report.h"
#include "qapi/error.h"
#include "qapi/visitor.h"
#include "hw/hw.h"
#include "hw/sysbus.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "hw/registerfields.h"
#include "hw/boards.h"
#include "hw/timer/esp_timg.h"

#define TIMG_DEBUG      0
#define TIMG_WARNING    0

#define FIELD_CHANGED(value1, value2, reg, field) \
    ((value1) & R_ ## reg ## _ ## field ## _MASK) != ((value2) & R_ ## reg ## _ ## field ## _MASK)

/**
 * Helper to load a 32-bit low value and a 22-bit high value into a 64-bit value
 */
static inline uint64_t load_low(uint64_t reg, uint32_t low)
{
    return (reg & (0xffffffff00000000)) | (low & UINT32_MAX);
}

static inline uint64_t load_high(uint64_t reg, uint32_t high)
{
    return (reg & UINT32_MAX) | ((uint64_t) (high & 0x3fffff) << 32);
}


/**
 * @brief Update the value of a counter according the QEMU virtual timer.
 */
static int64_t esp_virtual_counter_update(ESPVirtualCounter *counter)
{
    const int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    const int64_t elapsed_ns = now - counter->base;
    const int64_t ticks = (elapsed_ns * (counter->frequency / 1000)) / 1000000;
    counter->value += ticks;
    counter->base = now;
    return counter->value;
}

static inline QEMUTimer* esp_virtual_counter_get_timer(ESPVirtualCounter *counter)
{
    return &counter->timer;
}

static void esp_virtual_counter_alarm_in_ticks(ESPVirtualCounter *counter, int64_t ticks)
{
    int64_t delay_ns = (ticks * (1000000000UL / counter->frequency));
    const int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    /* This function will reschedule the clock if it was already scheduled */
    counter->base = now;
    counter->value = 0;
    timer_mod_ns(&counter->timer, now + delay_ns);
}

/**
 * Update the time base of the timer without updating the counter value.
 * This shall be used when the counter has just been re-enabled, and the elapsed time since it was disabled
 * must not be taken into account.
 */
static void esp_virtual_counter_reenabled(ESPVirtualCounter *counter)
{
    counter->base = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
}

static void esp_virtual_counter_reset(ESPVirtualCounter* counter)
{
    timer_del(&counter->timer);
    counter->base = 0;
    counter->value = 0;
    counter->frequency = ESP_APB_CLK; // Hz
}


/**
 * @brief Function called when an update of the RTC Calibration register is requested
 *        Perform the required calibration simulation here and update the register.
 */
static void esp_timg_rtc_cali_update(ESPTimgState *s, uint32_t value)
{
    const uint32_t osc_freq_arr[] = {
        [ESP_TIMG_CALI_RC_SLOW_CLK]     = ESP_RC_SLOW_FREQ,
        [ESP_TIMG_CALI_RC_FAST_DIV_CLK] = ESP_RC_FAST_DIV_FREQ,
        [ESP_TIMG_CALI_XTAL32K_CLK]     = ESP_XTAL32K_FREQ
    };
    /* Copy the new value to the register but keep RDY bit to 0 (read-only) */
    value &= ~(R_TIMG_RTCCALICFG_RDY_MASK);

    /* Check if a start (one-time or periodic) was triggered */
    if (value & (R_TIMG_RTCCALICFG_START_MASK | R_TIMG_RTCCALICFG_START_CYCLING_MASK)) {

        /* Get the clock that is being calibrated */
        const uint32_t clk = FIELD_EX32(value, TIMG_RTCCALICFG, CLK_SEL);
        const uint32_t freq = osc_freq_arr[clk];

        /* And the counter that should be reached by this clock */
        const uint32_t max_count = FIELD_EX32(value, TIMG_RTCCALICFG, MAX);

        /* Calculate how many clock cycle it would require to the XTAL_CLK to reach this count */
        const uint32_t xtal_count = (ESP_XTAL_CLK * max_count) / freq;

        /* Save this count in the RTC Calibration register 1 */
        s->rtc.rtc_cali_cfg_result = xtal_count << R_TIMG_RTCCALICFG1_VALUE_SHIFT;

        value |= R_TIMG_RTCCALICFG_RDY_MASK;

        /* Clear the timeout register */
        s->rtc.rtc_cali_cfg_timeout &= ~(R_TIMG_RTCCALICFG2_TIMEOUT_MASK);
    }

    s->rtc.rtc_cali_cfg = value;
}

/**
 * @brief Function called when an update on the timeout register occur.
 */
static void esp_timg_rtc_cali_check_timeout(ESPTimgState *s, uint32_t value)
{
    /* Let's simplify the process of timeout generation, if the timeout reset count is smaller
     * than the max cali count divided by a constant, generate a timeout  */
    const uint32_t count = FIELD_EX32(s->rtc.rtc_cali_cfg, TIMG_RTCCALICFG, MAX);
    const uint32_t rst_cnt = FIELD_EX32(value, TIMG_RTCCALICFG2, TIMEOUT_RST_CNT);

    s->rtc.rtc_cali_cfg_timeout = value & ~(R_TIMG_RTCCALICFG2_TIMEOUT_MASK);

    if (rst_cnt == 0 || (rst_cnt < count / 10))
    {
        s->rtc.rtc_cali_cfg_timeout |= R_TIMG_RTCCALICFG2_TIMEOUT_MASK;
    }
}

/**
 * Functions related to Watchdog
 */

static inline uint64_t esp_wdt_ext_clk_frequency(ESPWdtState* wdt)
{
    return FIELD_EX32(wdt->config0, TIMG_WDTCONFIG0, USE_XTAL) ? ESP_XTAL_CLK : ESP_APB_CLK;
}

static inline bool esp_wdt_is_writable(ESPWdtState* wdt)
{
    return wdt->wkey == ESP_WDT_DEFAULT_WKEY;
}

static inline bool esp_wdt_enabled(ESPWdtState* wdt)
{
    return FIELD_EX32(wdt->config0, TIMG_T0CONFIG, EN) ? 1 : 0;
}


static void esp_wdt_cb(void* opaque)
{
    ESPWdtState* wdt = (ESPWdtState*) opaque;
    const int cur_stage = wdt->current_stage;
    ESPWdtStageConf conf = wdt->stage_conf[cur_stage];

    /* Retrieve the `wdt_disable` property */
    ESPTimgState* state = container_of(opaque, ESPTimgState, wdt);

    if (state->wdt_disable) {
        return;
    }

    /* Check which action must be taken for the current stage */
    if (conf == ESP_WDT_INTERRUPT) {
        wdt->raw_st = 1;
        if (wdt->int_enabled) {
            qemu_irq_raise(wdt->interrupt_irq);
        }
    } else if (conf == ESP_WDT_RESET_CPU || conf == ESP_WDT_RESET_SYS) {
        qemu_irq_raise(wdt->reset_irq);
        /* Do not schedule anything if we have to reset the machine */
        return;
    }

    const int new_stage = (cur_stage + 1)  % ESP_WDT_STAGE_COUNT;
    wdt->current_stage = new_stage;

    if (conf == ESP_WDT_OFF) {
        /* If the current stage is disabled, the counter shall not be reset to 0!
         * Get the number of ticks elapsed to calculate the remaining ticks before the next stage alarm.
         * A simpler option would be to reuse wdt->stage[cur_stage], but if the application modified this
         * register after scheduling an alarm, the result would be undefined. */
        const int64_t elapsed = esp_virtual_counter_update(&wdt->counter);
        esp_virtual_counter_alarm_in_ticks(&wdt->counter, wdt->stage[new_stage] - elapsed);
    } else {
        esp_virtual_counter_alarm_in_ticks(&wdt->counter, wdt->stage[new_stage]);
    }
}

static void esp_wdt_update_prescaler(ESPWdtState* wdt, uint32_t value)
{
    if (FIELD_EX32(value, TIMG_WDTCONFIG1, DIVCNT_RST) || value == 0) {
        /* Avoid any divide-by-0 error in the code below */
        wdt->prescaler = 1;
    } else {
        wdt->prescaler = FIELD_EX32(value, TIMG_WDTCONFIG1, CLK_PRESCALE);
    }

    /* Recalculate the frequency out of the new prescaler and current clock */
    wdt->counter.frequency = esp_wdt_ext_clk_frequency(wdt) / wdt->prescaler;

    /* In theory we should reschedule the timer if it is currently running.
     * In practice, let's say that this behavior is invalid  and do not reschedule it. */
}

static void esp_wdt_update_stage(ESPWdtState* wdt, int index, uint32_t value, bool verify)
{
    wdt->stage[index] = value;

