vecnode/esp32js/hw/timer/esp_timg.c
    /* If the updated stage is the current one and the watchdog is enabled, reprogram the timer */
    if (esp_wdt_enabled(wdt) && wdt->current_stage == index && verify) {
        /* Update the counter of the running timer, so that we can adjust the alarm */
        int64_t counter_value = esp_virtual_counter_update(&wdt->counter);
        int64_t diff = (int64_t) value - counter_value;
        if (diff <= 0) {
            /* On the real hardware, the WDT is simply disabled if the new comparator value for the current
             * stage is smaller than the current value. It will be restarted (not resumed) when fed.
             * Just like the real hardware, keep the "enable" bit to 1, moreover it is required for feeding.
             */
            timer_del(&wdt->counter.timer);
        } else {
            /* The new alarm is set to happen in `diff` ticks, reschedule the alarm */
            esp_virtual_counter_alarm_in_ticks(&wdt->counter, diff);
        }
    }
}

static void esp_wdt_feed(ESPWdtState* wdt)
{
    if (esp_wdt_enabled(wdt)) {
        wdt->current_stage = 0;
        esp_virtual_counter_alarm_in_ticks(&wdt->counter, wdt->stage[0]);
    }
}

static void esp_wdt_update_config(ESPWdtState* wdt, uint32_t value)
{
    /* If the WDT is protected return */
    if (!esp_wdt_is_writable(wdt)) {
        return;
    }

    const uint32_t former_conf = wdt->config0;
    /* Clean the reserved bits */
    wdt->config0 = value & ~(R_TIMG_WDTCONFIG0_CONF_UPDATE_EN_MASK | 0x7ff);

    const bool enabled = FIELD_EX32(value, TIMG_WDTCONFIG0, EN) ? true : false;
    const bool enabled_changed = FIELD_EX32(former_conf, TIMG_WDTCONFIG0, EN) != enabled;

    if (FIELD_EX32(value, TIMG_WDTCONFIG0, CONF_UPDATE_EN)) {
        /* If the prescaler value or the source clock changed update the timer */
        if ((FIELD_EX32(wdt->prescaler_mirror, TIMG_WDTCONFIG1, CLK_PRESCALE) != wdt->prescaler) ||
            (FIELD_EX32(former_conf, TIMG_WDTCONFIG0, USE_XTAL) != FIELD_EX32(value, TIMG_WDTCONFIG0, USE_XTAL)))
        {
            esp_wdt_update_prescaler(wdt, wdt->prescaler_mirror);
        }

        /* Update the stage configuration mirror */
        wdt->stage_conf[0] = FIELD_EX32(value, TIMG_WDTCONFIG0, STG0);
        wdt->stage_conf[1] = FIELD_EX32(value, TIMG_WDTCONFIG0, STG1);
        wdt->stage_conf[2] = FIELD_EX32(value, TIMG_WDTCONFIG0, STG2);
        wdt->stage_conf[3] = FIELD_EX32(value, TIMG_WDTCONFIG0, STG3);

        /* Update the stage values */
        for (int i = 0; i < ESP_WDT_STAGE_COUNT; i++) {
            /* Only reprogram the timer if the enable flag didn't change */
            esp_wdt_update_stage(wdt, i, wdt->stage_mirror[i], enabled && !enabled_changed);
        }
    }

    /* Check if the enabled bit changed */
    if (enabled_changed) {
        if (enabled) {
            wdt->config0 |= R_TIMG_WDTCONFIG0_EN_MASK;
            /* Timer has just been (re-)enabled, schedule the timer */
            esp_virtual_counter_alarm_in_ticks(&wdt->counter, wdt->stage[0]);
        } else {
            wdt->config0 &= ~R_TIMG_WDTCONFIG0_EN_MASK;
            /* Disable the timer! */
            timer_del(&wdt->counter.timer);
        }
    }
}

/**
 * Functions related to T0 timer registers
 */
static void esp_t0_update_counter(ESPT0State* t)
{
    int64_t previous = t->counter.value;
    int64_t current = esp_virtual_counter_update(&t->counter);
    int64_t delta = current - previous;
    const bool increase = FIELD_EX32(t->config, TIMG_T0CONFIG, INCREASE) ? true : false;
    if (increase) {
        t->value_rel = (t->value_rel + delta) & ESP_TIMG_T0_MAX_VALUE;
    } else {
        t->value_rel = (t->value_rel - delta) & ESP_TIMG_T0_MAX_VALUE;
    }
}


static void esp_t0_cb(void* opaque)
{
    ESPT0State* t = (ESPT0State*) opaque;

    /* Disable the alarm timer */
    timer_del(&t->counter.timer);
    esp_virtual_counter_reenabled(&t->counter);

    /* In practice, the counter is bigger than the requested value, this is due to the fact
     * that there is a cost of emulation and the (Linux) kernel timer may also be busy
     * doing something else before scheduling the VM. Adjust the counter to the alarm value. */
    t->value_rel = t->alarm;

    /* If the counter is set to auto-reload, set its new value */
    if (FIELD_EX32(t->config, TIMG_T0CONFIG, AUTORELOAD)) {
        t->value_rel = t->value_toload;
    }

    /* Alarm was triggered, clear alarm bit, set the IRQ if interrupts enabled */
    t->config &= ~R_TIMG_T0CONFIG_ALARM_EN_MASK;
    t->raw_st = 1;
    if (t->int_enabled) {
        qemu_irq_raise(t->interrupt_irq);
    }
}


static void esp_t0_counter_flush(ESPT0State* t)
{
    if (FIELD_EX32(t->config, TIMG_T0CONFIG, EN)) {
        esp_t0_update_counter(t);
    }

    t->value_flushed = t->value_rel;
}


static void esp_t0_alarm_update(ESPT0State* t)
{

    if (FIELD_EX32(t->config, TIMG_T0CONFIG, EN) &&
        FIELD_EX32(t->config, TIMG_T0CONFIG, ALARM_EN)) {

        const bool increase = FIELD_EX32(t->config, TIMG_T0CONFIG, INCREASE) ? true : false;
        const bool decrease = !increase;
        const uint64_t alarm = t->alarm;

        /* Update the current value of the relative counter */
        esp_t0_update_counter(t);

        /* No matter if we increase or decrease the counter the time difference is the same */
        const uint64_t value = t->value_rel;
        uint64_t diff = (alarm > value) ? alarm - value : value - alarm;
        const uint64_t limit = ESP_TIMG_T0_LIMIT;

        /* Declare all the possible scenarios as explained in the TRM */
        const bool scenario1 = alarm >  value && diff >  limit;
        const bool scenario2 = alarm >  value && diff <= limit;
        const bool scenario3 = value >= alarm && diff <  limit;
        const bool scenario4 = value >= alarm && diff >= limit;
        const bool scenario5 = alarm <  value && diff >  limit;
        const bool scenario6 = alarm <  value && diff <= limit;
        const bool scenario7 = value <= alarm && diff <  limit;
        const bool scenario8 = value <= alarm && diff >= limit;

        if ((increase && (scenario1 || scenario3)) || (decrease && (scenario5 || scenario7))) {
            /* The alarm was programmed too late, trigger an interrupt manually */
            esp_t0_cb(t);
        } else if ((increase && scenario2) || (decrease && scenario6)) {
            /* The alarm is in range and in the future, program its trigger */
            esp_virtual_counter_alarm_in_ticks(&t->counter, diff);
        } else {
            assert(scenario4 || scenario8);
            /* The alarm is in range, in the future, but requires the timer to overflow/underflow */
            const uint64_t high = MAX(alarm, value);
            const uint64_t low  = MIN(alarm, value);
            /* Calculate the new (tick) difference between them */
            diff = (ESP_TIMG_T0_MAX_VALUE + 1 - high) + low;
            esp_virtual_counter_alarm_in_ticks(&t->counter, diff);
        }

