vecnode/esp32js/hw/timer/esp_timg.c
    }
}


static void esp_t0_counter_load(ESPT0State* t)
{
    /* Update the counter so that the (time) base is up to date */
    esp_t0_update_counter(t);

    /* Set the new counter */
    t->value_rel = t->value_toload;

    /* Reprogram the alarm if necessary */
    esp_t0_alarm_update(t);
}

static void esp_t0_config_update(ESPT0State* t0, uint32_t value)
{
    const uint32_t former_conf = t0->config;
    /* Assign the new configuration while removing the write-only bits */
    t0->config = value & ~(R_TIMG_T0CONFIG_DIVCNT_RST_MASK);

    /* If the counter was enabled until now, update its value */
    if (former_conf & R_TIMG_T0CONFIG_EN_MASK) {
        esp_t0_update_counter(t0);
    }

    /* Calculate the new frequency */
    const uint32_t new_divider = FIELD_EX32(value, TIMG_T0CONFIG, DIVIDER);
    const uint64_t new_clk = FIELD_EX32(value, TIMG_T0CONFIG, USE_XTAL) ? ESP_XTAL_CLK : ESP_APB_CLK;
    const uint64_t new_freq = new_clk / new_divider;
    if (new_freq != t0->counter.frequency) {
        t0->counter.frequency = new_freq;
    }

    if (value & R_TIMG_T0CONFIG_DIVCNT_RST_MASK) {
        esp_virtual_counter_reset(&t0->counter);
        esp_t0_alarm_update(t0);
    }

    /* If the alarm state just changed, we have to load it or disable it */
    if (FIELD_CHANGED(former_conf, value, TIMG_T0CONFIG, ALARM_EN)) {
        if (value & R_TIMG_T0CONFIG_ALARM_EN_MASK) {
            esp_t0_alarm_update(t0);
        } else {
            timer_del(&t0->counter.timer);
        }
    }

    /* If the direction of the counter changed, reprogram the alarm. The function esp_t0_alarm_update
     * will check if the counter and alarm are enabled first, no need to do it here. */
    if (FIELD_CHANGED(former_conf, value, TIMG_T0CONFIG, INCREASE)) {
        esp_t0_alarm_update(t0);
    }

    /* Finally, check if the counter state changed */
    if (FIELD_CHANGED(former_conf, value, TIMG_T0CONFIG, EN)) {
        if (value & R_TIMG_T0CONFIG_EN_MASK) {
            /* the counter was disabled, it has just been re-enabled, its value should not be updated,
             * but the base time should be updated to now. */
            esp_virtual_counter_reenabled(&t0->counter);
            esp_t0_alarm_update(t0);
        } else {
            /* In theory, we should update the counter before disabling its timer, but in practice, we
             * already did that at the beginning of this function. Thus, the base time is correct. */
            timer_del(&t0->counter.timer);
        }
    }
}


/**
 * Functions related to the hardware registers
 */
static uint64_t esp_timg_read(void *opaque, hwaddr addr, unsigned int size)
{
    ESPTimgState *s = ESP_TIMG(opaque);
    ESPT0State   *t = &s->t0;
    ESPTimgClass *klass = ESP_TIMG_GET_CLASS(s);
    uint32_t      wdt_shift = R_TIMG_T0_INT_TIMG_WDT_RAW_SHIFT;
    uint32_t      t0_shift  = R_TIMG_T0_INT_TIMG_T0_RAW_SHIFT;
    uint32_t      t1_shift  = R_TIMG_T0_INT_TIMG_T1_RAW_SHIFT;

    /* Check if the timer to change/configure is the first or the second one, of course, this only applies
     * to targets who have two timers */
    if (klass->m_has_t1 && addr >= A_TIMG_T1CONFIG && addr <= A_TIMG_T1LOAD) {
        /* Shifting the registers works because the T0 and T1 configuration registers directly follow each other */
        addr -= A_TIMG_T1CONFIG;
        t = &s->t1;
    }

    /**
     * On targets that have both T0 and T1, the interrupt registers lowest 3 bits are organized as:
     * WDT_bit | T1_bit  | T0_bit
     * On other targets, they are organized as:
     *    0    | WDT_bit | T0_bit
     **/
    if (klass->m_has_t1) {
        wdt_shift = R_TIMG_T0T1_INT_TIMG_WDT_RAW_SHIFT;
        t0_shift  = R_TIMG_T0T1_INT_TIMG_T0_RAW_SHIFT;
        t1_shift  = R_TIMG_T0T1_INT_TIMG_T1_RAW_SHIFT;
    }

    uint64_t r = 0;
    switch (addr) {
        case A_TIMG_RTCCALICFG:
            r = s->rtc.rtc_cali_cfg;
            break;
        case A_TIMG_RTCCALICFG1:
            r = s->rtc.rtc_cali_cfg_result;
            break;
        case A_TIMG_RTCCALICFG2:
            r = s->rtc.rtc_cali_cfg_timeout;
            break;


        /* Timer (T0) related registers */
        case A_TIMG_T0CONFIG:
            r = t->config;
            break;
        case A_TIMG_T0LO:
            r = t->value_flushed & UINT32_MAX;
            break;
        case A_TIMG_T0HI:
            r = t->value_flushed >> 32;
            break;
        case A_TIMG_T0UPDATE:
            /* Write-only register */
            break;
        case A_TIMG_T0ALARMLO:
            r = t->alarm & UINT32_MAX;
            break;
        case A_TIMG_T0ALARMHI:
            r = t->alarm >> 32;
            break;
        case A_TIMG_T0LOADLO:
            r = t->value_toload & UINT32_MAX;
            break;
        case A_TIMG_T0LOADHI:
            r = t->value_toload >> 32;
            break;
        case A_TIMG_T0LOAD:
            /* Write-only register */
            break;


        /* Watchdog related registers */
        case A_TIMG_WDTCONFIG0:
            r = s->wdt.config0;
            break;
        case A_TIMG_WDTCONFIG1:
            r = s->wdt.prescaler_mirror & ~R_TIMG_WDTCONFIG1_DIVCNT_RST_MASK;
            break;
        case A_TIMG_WDTCONFIG2:
        case A_TIMG_WDTCONFIG3:
        case A_TIMG_WDTCONFIG4:
        case A_TIMG_WDTCONFIG5:
            r = s->wdt.stage_mirror[(addr - A_TIMG_WDTCONFIG2) / sizeof(uint32_t)];
            break;
        case A_TIMG_WDTFEED:
            /* This register is read-only, but avoid a warning */
            break;
        case A_TIMG_WDTWPROTECT:
            r = s->wdt.wkey;
            break;

        /**
         * On targets that have both T0 and T1, the interrupt registers lowest 3 bits are organized as:
         * WDT_bit | T1_bit  | T0_bit
         * On other targets, they are organized as:
         *    0    | WDT_bit | T0_bit
         **/
        case A_TIMG_INT_ENA_TIMG:
            r = s->wdt.int_enabled << wdt_shift |
                s->t1.int_enabled  << t1_shift  |
                s->t0.int_enabled  << t0_shift;
            break;
        case A_TIMG_INT_RAW_TIMG:
            r = s->wdt.raw_st << wdt_shift |
                s->t1.raw_st  << t1_shift  |
                s->t0.raw_st  << t0_shift;
            break;
        case A_TIMG_INT_ST_TIMG:
            r = (s->wdt.int_enabled && s->wdt.raw_st) << wdt_shift |
                (s->t1.int_enabled  && s->t1.raw_st)  << t1_shift  |
                (s->t0.int_enabled  && s->t0.raw_st)  << t0_shift;
            break;

        default:
#if TIMG_WARNING
            warn_report("[TIMG] Unsupported read from %08lx", addr);
#endif
            break;
    }

