vecnode/esp32js/hw/timer/esp_timg.c
#if TIMG_DEBUG
    info_report("[TIMG] Reading from %08lx (%08lx)", addr, r);
#endif
    return r;
}

static void esp_timg_write(void *opaque, hwaddr addr,
                       uint64_t value, unsigned int size)
{
    ESPTimgState *s = ESP_TIMG(opaque);
    ESPT0State   *t = &s->t0;
    ESPTimgClass *klass = ESP_TIMG_GET_CLASS(s);
    uint32_t      wdt_mask = R_TIMG_T0_INT_TIMG_WDT_RAW_MASK;
    uint32_t      t0_mask  = R_TIMG_T0_INT_TIMG_T0_RAW_MASK;
    uint32_t      t1_mask  = R_TIMG_T0_INT_TIMG_T1_RAW_MASK;

    /* Check if the timer to change/configure is the first or the second one, of course, this only applies
     * to targets who have two timers */
    if (klass->m_has_t1 && addr >= A_TIMG_T1CONFIG && addr <= A_TIMG_T1LOAD) {
        /* Shifting the registers works because the T0 and T1 configuration registers directly follow each other */
        addr -= A_TIMG_T1CONFIG;
        t = &s->t1;
    }

    /**
     * On targets that have both T0 and T1, the interrupt registers lowest 3 bits are organized as:
     * WDT_bit | T1_bit  | T0_bit
     * On other targets, they are organized as:
     *    0    | WDT_bit | T0_bit
     **/
    if (klass->m_has_t1) {
        wdt_mask = R_TIMG_T0T1_INT_TIMG_WDT_RAW_MASK;
        t0_mask  = R_TIMG_T0T1_INT_TIMG_T0_RAW_MASK;
        t1_mask  = R_TIMG_T0T1_INT_TIMG_T1_RAW_MASK;
    }


    switch(addr) {
        case A_TIMG_RTCCALICFG:
            esp_timg_rtc_cali_update(s, value);
            break;
        case A_TIMG_RTCCALICFG2:
            esp_timg_rtc_cali_check_timeout(s, value);
            break;

        /* Timer (T0) related registers */
        case A_TIMG_T0CONFIG:
            esp_t0_config_update(t, value);
            break;
        case A_TIMG_T0LO:
        case A_TIMG_T0HI:
            /* These registers are read-only but implement them to avoid getting a warning */
            break;
        case A_TIMG_T0UPDATE:
            esp_t0_counter_flush(t);
            break;
        case A_TIMG_T0ALARMLO:
            t->alarm = load_low(t->alarm, value);
            esp_t0_alarm_update(t);
            break;
        case A_TIMG_T0ALARMHI:
            t->alarm = load_high(t->alarm, value);
            esp_t0_alarm_update(t);
            break;
        case A_TIMG_T0LOADLO:
            t->value_toload = load_low(t->value_toload, value);
            break;
        case A_TIMG_T0LOADHI:
            t->value_toload = load_high(t->value_toload, value);
            break;
        case A_TIMG_T0LOAD:
            esp_t0_counter_load(t);
            break;


        /* Watchdog related registers */
        case A_TIMG_WDTCONFIG0:
            esp_wdt_update_config(&s->wdt, value);
            break;
        case A_TIMG_WDTCONFIG1:
            s->wdt.prescaler_mirror = value;
            break;
        case A_TIMG_WDTCONFIG2:
        case A_TIMG_WDTCONFIG3:
        case A_TIMG_WDTCONFIG4:
        case A_TIMG_WDTCONFIG5:
            s->wdt.stage_mirror[(addr - A_TIMG_WDTCONFIG2) / sizeof(uint32_t)] = value;
            break;
        case A_TIMG_WDTFEED:
            esp_wdt_feed(&s->wdt);
            break;
        case A_TIMG_WDTWPROTECT:
            s->wdt.wkey = value;
            break;
        case A_TIMG_INT_ENA_TIMG: {
            bool former = s->t0.int_enabled;
            s->t0.int_enabled  = (value & t0_mask)  ? true : false;
            if (s->t0.int_enabled != former) {
                qemu_set_irq(s->t0.interrupt_irq,
                             s->t0.raw_st && s->t0.int_enabled ? 1 : 0);
            }

            former = s->t1.int_enabled;
            s->t1.int_enabled  = (value & t1_mask)  ? true : false;
            if (s->t1.int_enabled != former) {
                qemu_set_irq(s->t1.interrupt_irq,
                             s->t1.raw_st && s->t1.int_enabled ? 1 : 0);
            }

            former = s->wdt.int_enabled;
            s->wdt.int_enabled = (value & wdt_mask) ? true : false;
            if (s->wdt.int_enabled != former) {
                qemu_set_irq(s->wdt.interrupt_irq,
                             s->wdt.raw_st && s->wdt.int_enabled ? 1 : 0);
            }
            break;
        }
        case A_TIMG_INT_CLR_TIMG:
            if (value & t0_mask) {
                s->t0.raw_st = 0;
                qemu_irq_lower(s->t0.interrupt_irq);
            }
            if (value & t1_mask) {
                s->t1.raw_st = 0;
                qemu_irq_lower(s->t1.interrupt_irq);
            }
            if (value & wdt_mask) {
                s->wdt.raw_st = 0;
                qemu_irq_lower(s->wdt.interrupt_irq);
            }
            break;
        case A_TIMG_INT_RAW_TIMG:
        case A_TIMG_INT_ST_TIMG:
            break;

        default:
#if TIMG_WARNING
            warn_report("[TIMG] Unsupported write to %08lx (%08lx)", addr, value);
#endif
            break;
    }

#if TIMG_DEBUG
    info_report("[TIMG] Writing to %08lx = %08lx", addr, value);
#endif
}


static const MemoryRegionOps esp_timg_ops = {
    .read =  esp_timg_read,
    .write = esp_timg_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};


static void esp_timg_reset_hold(Object *obj, ResetType type)
{
    ESPTimgState *s = ESP_TIMG(obj);

    /* Reset watchdog */
    esp_virtual_counter_reset(&s->wdt.counter);
    s->wdt.config0 = 0;
    s->wdt.wkey = ESP_WDT_DEFAULT_WKEY;
    s->wdt.current_stage = 0;
    memset(&s->wdt.stage_conf, 0, sizeof(s->wdt.stage_conf));
    s->wdt.stage[0] = 26000000;
    s->wdt.stage[1] = 0x7FFFFFFF;
    s->wdt.stage[2] = 0x0FFFFFFF;
    s->wdt.stage[3] = 0x0FFFFFFF;
    s->wdt.prescaler = 1;
    s->wdt.raw_st = 0;
    s->wdt.int_enabled = 0;

    /* Reset Timer0 */
    esp_virtual_counter_reset(&s->t0.counter);
    s->t0.raw_st = 0;
    s->t0.int_enabled = 0;
    s->t0.value_rel = 0;
    /* Set the divider to 1 */
    s->t0.config = 1 << R_TIMG_T0CONFIG_DIVIDER_SHIFT;

    /* Reset Timer1 even if the target doesn't have T1 */
    esp_virtual_counter_reset(&s->t1.counter);
    s->t1.raw_st = 0;
    s->t1.int_enabled = 0;
    s->t1.value_rel = 0;
    s->t1.config = 1 << R_TIMG_T0CONFIG_DIVIDER_SHIFT;
}


