vecnode/esp32js/hw/timer/esp_timg.c
static void esp_timg_realize(DeviceState *dev, Error **errp)
{
}


static void esp_timg_init(Object *obj)
{
    ESPTimgState *s = ESP_TIMG(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);
    ESPTimgClass *klass = ESP_TIMG_GET_CLASS(s);

    memory_region_init_io(&s->iomem, obj, &esp_timg_ops, s,
                          TYPE_ESP_TIMG, ESP_TIMG_IO_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);

    /* Set default value to calibration register */
    s->rtc.rtc_cali_cfg = 1 << R_TIMG_RTCCALICFG_MAX_SHIFT |
                         1 << R_TIMG_RTCCALICFG_CLK_SEL_SHIFT |
                         1 << R_TIMG_RTCCALICFG_START_CYCLING_SHIFT;

    /* Watchdog initialization */
    s->wdt.wkey = ESP_WDT_DEFAULT_WKEY;
    qdev_init_gpio_out_named(DEVICE(sbd), &s->wdt.reset_irq, ESP_WDT_IRQ_RESET, 1);
    qdev_init_gpio_out_named(DEVICE(sbd), &s->wdt.interrupt_irq, ESP_WDT_IRQ_INTERRUPT, 1);
    timer_init_ns(esp_virtual_counter_get_timer(&s->wdt.counter), QEMU_CLOCK_VIRTUAL, esp_wdt_cb, &s->wdt);

    /* Timer T0 initialization */
    qdev_init_gpio_out_named(DEVICE(sbd), &s->t0.interrupt_irq, ESP_T0_IRQ_INTERRUPT, 1);
    timer_init_ns(esp_virtual_counter_get_timer(&s->t0.counter), QEMU_CLOCK_VIRTUAL, esp_t0_cb, &s->t0);

    /* Only initialize the timer T1 interrupt if the target supports it */
    if (klass->m_has_t1) {
        qdev_init_gpio_out_named(DEVICE(sbd), &s->t1.interrupt_irq, ESP_T1_IRQ_INTERRUPT, 1);
        timer_init_ns(esp_virtual_counter_get_timer(&s->t1.counter), QEMU_CLOCK_VIRTUAL, esp_t0_cb, &s->t1);
    }

    /* Set the initial values for the internal fields */
    esp_timg_reset_hold(obj, RESET_TYPE_COLD);
}

static Property esp_timg_properties[] = {
    DEFINE_PROP_BOOL("wdt_disable", ESPTimgState, wdt_disable, false),
    DEFINE_PROP_END_OF_LIST(),
};

static void esp_timg_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    rc->phases.hold = esp_timg_reset_hold;
    dc->realize = esp_timg_realize;
    device_class_set_props(dc, esp_timg_properties);
}

static const TypeInfo esp_timg_info = {
    .name = TYPE_ESP_TIMG,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(ESPTimgState),
    .instance_init = esp_timg_init,
    .class_init = esp_timg_class_init,
    .class_size = sizeof(ESPTimgClass),
    .abstract = true,
};

static void esp_timg_register_types(void)
{
    type_register_static(&esp_timg_info);
}

type_init(esp_timg_register_types)
